Resources.org
# -*- mode: org; -*-
#+INCLUDE: theme/style.org
#+TITLE: Emacs Resources 
#+KEYWORDS: emacs, links, resourse, utils, hyperlinks

* Resources
** Motivation

    * [[http://emacsblog.org/2014/08/21/the-editor-of-a-lifetime/][The Editor of a Lifetime]]

    * [[http://martinfowler.com/bliki/InternalReprogrammability.html][Internal Reprogrammability]] by Martin Fowler

    * [[https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-en.org][Master Emacs in one year]]

"This guide is about using Emacs as a professional’s tool. I will not
show off Emacs as a geek’s toy because I am far from geek
stereotype. I will focus on philosophy and methodology only. No
technical details involved."


    * [[http://emacs.sexy/][Emacs is sexy]]

    * [[http://batsov.com/articles/2011/11/19/why-emacs/][Why Emacs? - (think)]]

    * [[http://www.emacswiki.org/emacs/LispMachine][EmacsWiki: Lisp Machine]]

    * [[http://www.emacswiki.org/emacs/ChurchOfEmacs][The Church of Emacs!!]]

** Emacs Tutorials
*** Introduction to Elisp

    * [[http://emacslife.com/how-to-read-emacs-lisp.html][Read Lisp, Tweak Emacs: How to read Emacs Lisp so that you can customize Emacs by Sacha Chua]]
    * http://www.fincher.org/tips/Languages/Emacs.shtml
    * [[https://github.com/chrisdone/elisp-guide#manipulating-the-buffer][A quick guide to Emacs Lisp programming]]
    * [[http://emacs-doctor.com/learn-emacs-lisp-in-15-minutes.html][Learn Emacs Lisp in 15 minutes]]
    * [[http://steve-yegge.blogspot.it/2008/01/emergency-elisp.html][Emergency Elisp]]
    * [[http://wikemacs.org/wiki/Emacs_Lisp_Cookbook][Emacs Lisp Cookbook]]
    * [[https://github.com/doitian/emacs.d][Quick Started]]
    * [[http://ergoemacs.org][Xah's Emacs Tutorial - ErgoEmacs]]
    * [[https://www.masteringemacs.org/][Mastering Emacs mastering the world’s best text editor]]

    * [[http://www.splode.com/~friedman/software/emacs-lisp/][Software: Emacs Lisp]]

     Many useful Emacs Lisp codes like user interface enhancement.

    * [[http://rosettacode.org/wiki/Category:Emacs_Lisp][Rosetta Code/ Category:Emacs Lisp]]
    * [[http://emacswiki.org/emacs/ElispCookbook][Elisp Cookbook]]
    * [[http://ergoemacs.org/][ErgoEmacs]]
    * [[http://www.wilfred.me.uk/blog/2013/03/31/essential-elisp-libraries/][Essential Elisp Libraries - Functional Programmin in Elisp]]

*** Tips and Tricks

    * [[https://wiki.archlinux.org/index.php/Emacs][Emacs - Arch Linux Wiki]]
    * [[http://www.nongnu.org/emacs-tiny-tools/elisp-coding/index-body.html][Emacs Tiny Tools]]
    * [[https://github.com/emacs-tw/awesome-emacs][Awsome Emacs - A community driven list of useful Emacs packages, libraries and others.]]
    * [[https://translate.google.ca/translate?sl=auto&tl=en&js=y&prev=_t&hl=en&ie=UTF-8&u=http%3A%2F%2Femacs-jp.github.io%2Ftips%2Fenvironment-variable.html&edit-text=&act=url][Setting Environment Variables]]

    * [[http://tonyballantyne.com/tech/3-interactive-functions-that-work-on-regions/][3 Interactive Functions That Work On Regions]]

    * [[http://endlessparentheses.com/introducing-names-practical-namespaces-for-emacs-lisp.html][Introducing Names: practical namespaces for Emacs-Lisp]]

*** Packages

    * [[https://github.com/capitaomorte/yasnippet][Yasnippet]]

*** Cases

    * [[http://juanjoalvarez.net/es/detail/2014/sep/19/vim-emacsevil-chaotic-migration-guide/][From Vim to Emacs+Evil chaotic migration guide - From Vim to Emacs+Evil chaotic migration guide]]
    * [[http://technical-dresese.blogspot.com/2008/11/why-ive-abandoned-eclipse-for-emacs.html][Why Ive Abandoned Eclipse For Emacs]]
    * [[http://technical-dresese.blogspot.com/2008/08/in-org-mode-abandoning-gtd.html][In Org Mode Abandoning Gtd]]
    * [[http://tech.grammarly.com/blog/posts/Running-Lisp-in-Production.html][Running Lisp In Productionl]]

*** Non Categorized


    * http://homepage1.nifty.com/bmonkey/emacs/elisp/completing-help.el
    * http://www.reallysoft.de/code/emacs/snippets.html#b4ac15
    * https://marmalade-repo.org/
    * [[http://technical-dresese.blogspot.com/2012/12/hooks-local-variables-and-namespaces.html][Hooks Local Variables And Namespacesl]]
    * http://emacs.g.hatena.ne.jp/kiwanami/20110809/1312877192

** Cheat Sheets

 - [[http://scale-it.pl/emacs_cheatsheet.html][Emacs cheatsheet]]

** Documentation
*** Manual and References

    * [[http://www.delorie.com/gnu/docs/elisp-manual-21/elisp_toc.html#SEC_Contents][GNU Emacs Lisp Reference Manual]]
    * [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Command-Index.html][Command and Function Index]]
    * http://blog.gnumonk.com/2012/07/effective-emacs-part1.html

*** Wikis

    * [[https://wiki.archlinux.org/index.php/Emacs][Emacs / Arch Wiki]]
    * [[http://obsidianrook.com/devnotes/elisp-for-perl-programmers.html][Emacs Lisp for Perl Programmers]]
    * [[http://hyperpolyglot.org/lisp][Hyperglot / Lisp: Common Lisp, Racket, Clojure, Emacs Lisp]]

    *Github*

    * [[https://github.com/hypernumbers/learn_elisp_the_hard_way][Learn Elisp the Hard Way]]

    *Lexical Scope*

    * [[http://prog-elisp.blogspot.com.br/2012/05/lexical-scope.html][On elisp and programming in general]]

