Resources.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Resources</title>
<!-- 2016-09-29 qui 05:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<meta  name="description" content="Emacs programming and customization."
 />
<meta  name="keywords" content="emacs, elisp, lisp, programming, eshell, editor" />
<link href="theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Emacs Resources</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Resources</a>
<ul>
<li><a href="#sec-1-1">1.1. Motivation</a></li>
<li><a href="#sec-1-2">1.2. Emacs Tutorials</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Introduction to Elisp</a></li>
<li><a href="#sec-1-2-2">1.2.2. Tips and Tricks</a></li>
<li><a href="#sec-1-2-3">1.2.3. Packages</a></li>
<li><a href="#sec-1-2-4">1.2.4. Cases</a></li>
<li><a href="#sec-1-2-5">1.2.5. Non Categorized</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Cheat Sheets</a></li>
<li><a href="#sec-1-4">1.4. Documentation</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Manual and References</a></li>
<li><a href="#sec-1-4-2">1.4.2. Wikis</a></li>
<li><a href="#sec-1-4-3">1.4.3. Issues</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Selected Dot Emacs</a></li>
<li><a href="#sec-1-6">1.6. Emacs Starter Kits</a></li>
<li><a href="#sec-1-7">1.7. Fun</a></li>
<li><a href="#sec-1-8">1.8. Books</a></li>
<li><a href="#sec-1-9">1.9. Community</a></li>
<li><a href="#sec-1-10">1.10. Blogs</a></li>
<li><a href="#sec-1-11">1.11. Videos and Screencasts</a></li>
<li><a href="#sec-1-12">1.12. Selected Codes</a></li>
<li><a href="#sec-1-13">1.13. Technical Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Resources</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Motivation</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="http://emacsblog.org/2014/08/21/the-editor-of-a-lifetime/">The Editor of a Lifetime</a>
</li>

<li><a href="http://martinfowler.com/bliki/InternalReprogrammability.html">Internal Reprogrammability</a> by Martin Fowler
</li>

<li><a href="https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-en.org">Master Emacs in one year</a>
</li>
</ul>

<p>
"This guide is about using Emacs as a professional’s tool. I will not
show off Emacs as a geek’s toy because I am far from geek
stereotype. I will focus on philosophy and methodology only. No
technical details involved."
</p>


<ul class="org-ul">
<li><a href="http://emacs.sexy/">Emacs is sexy</a>
</li>

<li><a href="http://batsov.com/articles/2011/11/19/why-emacs/">Why Emacs? - (think)</a>
</li>

<li><a href="http://www.emacswiki.org/emacs/LispMachine">EmacsWiki: Lisp Machine</a>
</li>

<li><a href="http://www.emacswiki.org/emacs/ChurchOfEmacs">The Church of Emacs!!</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Emacs Tutorials</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Introduction to Elisp</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="http://emacslife.com/how-to-read-emacs-lisp.html">Read Lisp, Tweak Emacs: How to read Emacs Lisp so that you can customize Emacs by Sacha Chua</a>
</li>
<li><a href="http://www.fincher.org/tips/Languages/Emacs.shtml">http://www.fincher.org/tips/Languages/Emacs.shtml</a>
</li>
<li><a href="https://github.com/chrisdone/elisp-guide#manipulating-the-buffer">A quick guide to Emacs Lisp programming</a>
</li>
<li><a href="http://emacs-doctor.com/learn-emacs-lisp-in-15-minutes.html">Learn Emacs Lisp in 15 minutes</a>
</li>
<li><a href="http://steve-yegge.blogspot.it/2008/01/emergency-elisp.html">Emergency Elisp</a>
</li>
<li><a href="http://wikemacs.org/wiki/Emacs_Lisp_Cookbook">Emacs Lisp Cookbook</a>
</li>
<li><a href="https://github.com/doitian/emacs.d">Quick Started</a>
</li>
<li><a href="http://ergoemacs.org">Xah's Emacs Tutorial - ErgoEmacs</a>
</li>
<li><a href="https://www.masteringemacs.org/">Mastering Emacs mastering the world’s best text editor</a>
</li>

<li><a href="http://www.splode.com/~friedman/software/emacs-lisp/">Software: Emacs Lisp</a>

<p>
Many useful Emacs Lisp codes like user interface enhancement.
</p>
</li>

<li><a href="http://rosettacode.org/wiki/Category:Emacs_Lisp">Rosetta Code/ Category:Emacs Lisp</a>
</li>
<li><a href="http://emacswiki.org/emacs/ElispCookbook">Elisp Cookbook</a>
</li>
<li><a href="http://ergoemacs.org/">ErgoEmacs</a>
</li>
<li><a href="http://www.wilfred.me.uk/blog/2013/03/31/essential-elisp-libraries/">Essential Elisp Libraries - Functional Programmin in Elisp</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Tips and Tricks</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/index.php/Emacs">Emacs - Arch Linux Wiki</a>
</li>
<li><a href="http://www.nongnu.org/emacs-tiny-tools/elisp-coding/index-body.html">Emacs Tiny Tools</a>
</li>
<li><a href="https://github.com/emacs-tw/awesome-emacs">Awsome Emacs - A community driven list of useful Emacs packages, libraries and others.</a>
</li>
<li><a href="https://translate.google.ca/translate?sl=auto&tl=en&js=y&prev=_t&hl=en&ie=UTF-8&u=http://emacs-jp.github.io/tips/environment-variable.html&edit-text=&act=url">Setting Environment Variables</a>
</li>

<li><a href="http://tonyballantyne.com/tech/3-interactive-functions-that-work-on-regions/">3 Interactive Functions That Work On Regions</a>
</li>

<li><a href="http://endlessparentheses.com/introducing-names-practical-namespaces-for-emacs-lisp.html">Introducing Names: practical namespaces for Emacs-Lisp</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Packages</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li><a href="https://github.com/capitaomorte/yasnippet">Yasnippet</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Cases</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li><a href="http://juanjoalvarez.net/es/detail/2014/sep/19/vim-emacsevil-chaotic-migration-guide/">From Vim to Emacs+Evil chaotic migration guide - From Vim to Emacs+Evil chaotic migration guide</a>
</li>
<li><a href="http://technical-dresese.blogspot.com/2008/11/why-ive-abandoned-eclipse-for-emacs.html">Why Ive Abandoned Eclipse For Emacs</a>
</li>
<li><a href="http://technical-dresese.blogspot.com/2008/08/in-org-mode-abandoning-gtd.html">In Org Mode Abandoning Gtd</a>
</li>
<li><a href="http://tech.grammarly.com/blog/posts/Running-Lisp-in-Production.html">Running Lisp In Productionl</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Non Categorized</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li><a href="http://homepage1.nifty.com/bmonkey/emacs/elisp/completing-help.el">http://homepage1.nifty.com/bmonkey/emacs/elisp/completing-help.el</a>
</li>
<li><a href="http://www.reallysoft.de/code/emacs/snippets.html#b4ac15">http://www.reallysoft.de/code/emacs/snippets.html#b4ac15</a>
</li>
<li><a href="https://marmalade-repo.org/">https://marmalade-repo.org/</a>
</li>
<li><a href="http://technical-dresese.blogspot.com/2012/12/hooks-local-variables-and-namespaces.html">Hooks Local Variables And Namespacesl</a>
</li>
<li><a href="http://emacs.g.hatena.ne.jp/kiwanami/20110809/1312877192">http://emacs.g.hatena.ne.jp/kiwanami/20110809/1312877192</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Cheat Sheets</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="http://scale-it.pl/emacs_cheatsheet.html">Emacs cheatsheet</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Documentation</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Manual and References</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><a href="http://www.delorie.com/gnu/docs/elisp-manual-21/elisp_toc.html#SEC_Contents">GNU Emacs Lisp Reference Manual</a>
</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Command-Index.html">Command and Function Index</a>
</li>
<li><a href="http://blog.gnumonk.com/2012/07/effective-emacs-part1.html">http://blog.gnumonk.com/2012/07/effective-emacs-part1.html</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Wikis</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/index.php/Emacs">Emacs / Arch Wiki</a>
</li>
<li><a href="http://obsidianrook.com/devnotes/elisp-for-perl-programmers.html">Emacs Lisp for Perl Programmers</a>
</li>
<li><a href="http://hyperpolyglot.org/lisp">Hyperglot / Lisp: Common Lisp, Racket, Clojure, Emacs Lisp</a>
</li>
</ul>

<p>
<b>Github</b>
</p>

<ul class="org-ul">
<li><a href="https://github.com/hypernumbers/learn_elisp_the_hard_way">Learn Elisp the Hard Way</a>
</li>
</ul>

<p>
<b>Lexical Scope</b>
</p>

<ul class="org-ul">
<li><a href="http://prog-elisp.blogspot.com.br/2012/05/lexical-scope.html">On elisp and programming in general</a>
</li>
</ul>
</div>
</div>
