Resources.org
*** Issues

    * [[http://www.khngai.com/emacs/cygwin.php][Emacs on Windows / Cygwin]]
    * [[http://gregorygrubbs.com/emacs/10-tips-emacs-windows/][10 Tips for Powerful Emacs on Windows]]
** Selected Dot Emacs

    * [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's Emacs configuration]]

    * [[https://github.com/howardabrams/dot-files/blob/master/emacs.org][Howard Abrams dot emacs]]

    * http://uce.uniovi.es/tips/Emacs/mydotemacs.html

    * http://www.dgp.toronto.edu/~ghali/emacs.html

    * http://whattheemacsd.com/

    * https://snarfed.org/dotfiles/.emacs

    * http://web.mit.edu/Nelhage/Public/dot-elisp/site/g-client/json.el

** Emacs Starter Kits

*Spacemacs*

From the documentation:

Spacemacs is a new way to experience Emacs -- a sophisticated and
polished set-up focused on ergonomics, mnemonics and consistency. It
can be used naturally by both Emacs and Vim users -- you can even mix
the two editing styles. Switching easily between input styles makes
Spacemacs a great tool for pair-programming.

[[https://github.com/syl20bnr/spacemacs][Link Github]]

*Emacs Leuven*

Emacs configuration file with many packages already enabled and a more pleasant set of defaults.

[[https://github.com/fniessen/emacs-leuven][Link Github]]

*An Emacs Starter Kit for the Social Sciences*

[[http://kieranhealy.org/resources/emacs-starter-kit/][Link]]

** Fun


| Command                 | Description                               |
|-------------------------+-------------------------------------------|
| M-x doctor              | If you fell bad, lost your girlfriend ... |
| M-x life                | Run Conway's Life simulation.             |
| M-x dunnet              | Text based adventure game                 |
| M-x tetris              | Play Tetris.                              |
| M-x hanoi               | Towers of Hanoi.                          |
| M-x zone                | Make buffers go crazy!!                   |
| M-x zone-leave-me-alone | Stop zoning out.                          |

** Books

    - [[https://www.gnu.org/software/emacs/manual/pdf/eintr.pdf][An Introduction to Programming in Emacs Lisp]] by Robert J. Chassell

    - [[http://emacswiki.org/emacs/ElispCookbook][Elisp Cookbook - Emacs Wiki]]
    - http://wikemacs.org/wiki/Emacs_Lisp_Cookbook
    - [[http://www.bookshelf.jp/texi/lispintro/emacs-lisp-intro-en.html#SEC_Top][Programming in Emacs Lisp]]
    - [[http://www.bookshelf.jp/texi/emacs/emacs-en_toc.html#SEC_Contents][GNU Emacs Manual]]

    - [[http://unintelligible.org/onlisp/onlisp.html][On Lisp - by Paul Graham]] (Common Lisp)

** Community

*Usenet*

   - comp.emacs
   - gnu.emacs.help

It is also available at:

  - https://groups.google.com/forum/#!forum/comp.emacs
  - https://groups.google.com/forum/#!forum/gnu.emacs.help


*IRC*

   - http://www.emacswiki.org/emacs/InternetRelayChat

*Reddit*

   - http://reddit.com/r/emacs

*Stack Overflow*

  - http://stackoverflow.com/questions/tagged/emacs

*Gooble Plus*

  - [[https://plus.google.com/communities/114815898697665598016][Emacs - Community - Google+]]

** Blogs

  - [[http://endlessparentheses.com/archive.html][Endless Parentheses · Concise ramblings on Emacs productivity.]]

  - [[http://nic.ferrier.me.uk/][nic.ferrier.me.uk - what hacking is]]

  - http://xahlee.blogspot.com

  - [[http://nullprogram.com/][null program « null program]]

  - [[http://edward.oconnor.cx/elisp/][Emacs Lisp — Edward O’Connor]]

  - [[http://sachachua.com/blog/category/emacs/][emacs Archives - sacha chua - living an awesome life]]

  - [[http://emacsrocks.com/][Emacs Rocks!]]

  - [[http://emacs.readthedocs.org/en/latest/][About This Document — Emacs latest documentation]]

  - [[http://emacsredux.com/][Emacs Redux]]

