Resources.html

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Issues</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li><a href="http://www.khngai.com/emacs/cygwin.php">Emacs on Windows / Cygwin</a>
</li>
<li><a href="http://gregorygrubbs.com/emacs/10-tips-emacs-windows/">10 Tips for Powerful Emacs on Windows</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Selected Dot Emacs</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="http://pages.sachachua.com/.emacs.d/Sacha.html">Sacha Chua's Emacs configuration</a>
</li>

<li><a href="https://github.com/howardabrams/dot-files/blob/master/emacs.org">Howard Abrams dot emacs</a>
</li>

<li><a href="http://uce.uniovi.es/tips/Emacs/mydotemacs.html">http://uce.uniovi.es/tips/Emacs/mydotemacs.html</a>
</li>

<li><a href="http://www.dgp.toronto.edu/~ghali/emacs.html">http://www.dgp.toronto.edu/~ghali/emacs.html</a>
</li>

<li><a href="http://whattheemacsd.com/">http://whattheemacsd.com/</a>
</li>

<li><a href="https://snarfed.org/dotfiles/.emacs">https://snarfed.org/dotfiles/.emacs</a>
</li>

<li><a href="http://web.mit.edu/Nelhage/Public/dot-elisp/site/g-client/json.el">http://web.mit.edu/Nelhage/Public/dot-elisp/site/g-client/json.el</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Emacs Starter Kits</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<b>Spacemacs</b>
</p>

<p>
From the documentation:
</p>

<p>
Spacemacs is a new way to experience Emacs &#x2013; a sophisticated and
polished set-up focused on ergonomics, mnemonics and consistency. It
can be used naturally by both Emacs and Vim users &#x2013; you can even mix
the two editing styles. Switching easily between input styles makes
Spacemacs a great tool for pair-programming.
</p>

<p>
<a href="https://github.com/syl20bnr/spacemacs">Link Github</a>
</p>

<p>
<b>Emacs Leuven</b>
</p>

<p>
Emacs configuration file with many packages already enabled and a more pleasant set of defaults.
</p>

<p>
<a href="https://github.com/fniessen/emacs-leuven">Link Github</a>
</p>

<p>
<b>An Emacs Starter Kit for the Social Sciences</b>
</p>

<p>
<a href="http://kieranhealy.org/resources/emacs-starter-kit/">Link</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Fun</h3>
<div class="outline-text-3" id="text-1-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">M-x doctor</td>
<td class="left">If you fell bad, lost your girlfriend &#x2026;</td>
</tr>

<tr>
<td class="left">M-x life</td>
<td class="left">Run Conway's Life simulation.</td>
</tr>

<tr>
<td class="left">M-x dunnet</td>
<td class="left">Text based adventure game</td>
</tr>

<tr>
<td class="left">M-x tetris</td>
<td class="left">Play Tetris.</td>
</tr>

<tr>
<td class="left">M-x hanoi</td>
<td class="left">Towers of Hanoi.</td>
</tr>

<tr>
<td class="left">M-x zone</td>
<td class="left">Make buffers go crazy!!</td>
</tr>

<tr>
<td class="left">M-x zone-leave-me-alone</td>
<td class="left">Stop zoning out.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Books</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/pdf/eintr.pdf">An Introduction to Programming in Emacs Lisp</a> by Robert J. Chassell
</li>

<li><a href="http://emacswiki.org/emacs/ElispCookbook">Elisp Cookbook - Emacs Wiki</a>
</li>
<li><a href="http://wikemacs.org/wiki/Emacs_Lisp_Cookbook">http://wikemacs.org/wiki/Emacs_Lisp_Cookbook</a>
</li>
<li><a href="http://www.bookshelf.jp/texi/lispintro/emacs-lisp-intro-en.html#SEC_Top">Programming in Emacs Lisp</a>
</li>
<li><a href="http://www.bookshelf.jp/texi/emacs/emacs-en_toc.html#SEC_Contents">GNU Emacs Manual</a>
</li>

<li><a href="http://unintelligible.org/onlisp/onlisp.html">On Lisp - by Paul Graham</a> (Common Lisp)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Community</h3>
<div class="outline-text-3" id="text-1-9">
<p>
<b>Usenet</b>
</p>

<ul class="org-ul">
<li>comp.emacs
</li>
<li>gnu.emacs.help
</li>
</ul>

<p>
It is also available at:
</p>

<ul class="org-ul">
<li><a href="https://groups.google.com/forum/#!forum/comp.emacs">https://groups.google.com/forum/#!forum/comp.emacs</a>
</li>
<li><a href="https://groups.google.com/forum/#!forum/gnu.emacs.help">https://groups.google.com/forum/#!forum/gnu.emacs.help</a>
</li>
</ul>


<p>
<b>IRC</b>
</p>

<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/InternetRelayChat">http://www.emacswiki.org/emacs/InternetRelayChat</a>
</li>
</ul>

<p>
<b>Reddit</b>
</p>

<ul class="org-ul">
<li><a href="http://reddit.com/r/emacs">http://reddit.com/r/emacs</a>
</li>
</ul>

<p>
<b>Stack Overflow</b>
</p>

<ul class="org-ul">
<li><a href="http://stackoverflow.com/questions/tagged/emacs">http://stackoverflow.com/questions/tagged/emacs</a>
</li>
</ul>

<p>
<b>Gooble Plus</b>
</p>

<ul class="org-ul">
<li><a href="https://plus.google.com/communities/114815898697665598016">Emacs - Community - Google+</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Blogs</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li><a href="http://endlessparentheses.com/archive.html">Endless Parentheses · Concise ramblings on Emacs productivity.</a>
</li>

<li><a href="http://nic.ferrier.me.uk/">nic.ferrier.me.uk - what hacking is</a>
</li>

<li><a href="http://xahlee.blogspot.com">http://xahlee.blogspot.com</a>
</li>

<li><a href="http://nullprogram.com/">null program « null program</a>
</li>

<li><a href="http://edward.oconnor.cx/elisp/">Emacs Lisp — Edward O’Connor</a>
</li>

<li><a href="http://sachachua.com/blog/category/emacs/">emacs Archives - sacha chua - living an awesome life</a>
</li>

<li><a href="http://emacsrocks.com/">Emacs Rocks!</a>
</li>

<li><a href="http://emacs.readthedocs.org/en/latest/">About This Document — Emacs latest documentation</a>
</li>

<li><a href="http://emacsredux.com/">Emacs Redux</a>
</li>
</ul>
</div>
</div>
