Resources.org
** Videos and Screencasts

Useful screencasts to help learn Emacs faster.

*Basic Emacs*

   - [[https://www.youtube.com/watch?v=YAIZvpSOlAs][Hack Emacs - Working with Buffers]]

   - [[https://www.youtube.com/watch?v=aIMECr7K35Q][Hack Emacs - Working with Windows and Frames]]

   - [[https://www.youtube.com/watch?v=9anwyep2CR0][Hack Emacs - The Mark and the Point]]

   - [[https://www.youtube.com/watch?v=BTBAOOLM_tE][Hack Emacs - Using Initialization Files]]

   - [[https://www.youtube.com/watch?v=VmITzI-POv0][Hack Emacs - Loading Mechanisms]]
   In this episode, we look at four loading mechanisms for elisp: load, require, autoload and idle-require. User requested.

   - [[https://www.youtube.com/watch?v=IvihNaXANW0][Hack Emacs - Using the Customization System]]
   We explore the 'customize' system for customizing Emacs' behavior. The first of three parts covering the essential ways of changing Emacs' behavior at startup.



*Elisp*

  - [[https://www.youtube.com/watch?v=qajLhM0aseM][Buffer basics - Emacs Bites]]

    The basics of working with buffers in Emacs Lisp. Buffers are a
    central concept in Emacs of course and one of the main reasons
    it's useul. They are a versatile tool, you can use them for text
    to be edited but you can also use them for presenting user
    interfaces,   like Emacs' mail modes do.

  - [[https://www.youtube.com/watch?v=2z-YBsd5snY&list=PLakpda32F-ThIaulLS8yNN6I4U3Q8Yic_][An Introduction to Emacs Lisp]]

   Emacs can be thought of as a big Lisp interpreter, so you can't
   master Emacs without learning some Emacs Lisp. We'll be introducing
   Emacs  Lisp by describing its simple syntax, demonstrating a few
   Lisp functions for manipulating buffers, regions, and strings,
   writing a few utility functions, and binding those functions to
    custom keys. By the end of the talk, you should able to do the same.

  - [[https://www.youtube.com/watch?v=51mesucWxaM][Emacs Bites - the Crash Course]]

   Very basic intro to programming Emacs covering basic setq, let and
   defun for global variables, local variables and functions.


   - [[https://www.youtube.com/watch?v=-Woj10ARLWw][Dynamic vs lexical scope]]
   A small screencast to llustrate lexical and dynamic scope in Emacs
   with a very simple example.

  - [[https://www.youtube.com/watch?v=35EcPapMqOU&list=PLakpda32F-ThKQZ3XeYOfDa7ZtwEaK0j_&index=43][Hack Emacs - Working in the REPL]]
   In this episode I discuss how programming in Emacs is different than an IDE, and show a couple of short examples of how you can program in a REPL in Emacs Lisp and Scheme.
   I didn't cover quite as much as I hoped, so I might do a more technical in-depth episode on REPL usage.

*Development*

   - [[https://www.youtube.com/watch?v=QRBcm6jFJ3Q][2015-04-08 Emacs Lisp Development Tips with John Wiegley]]

   -  [[https://www.youtube.com/watch?v=Q-bmvMWqWmY][Advanced scratch - Emacs Bites]]

   A more in depth look at shell tricks we can use to start
   a scratch Emacs for testing packages and deployment and anything
   else you need a clean Emacs for.

*Debugging:*

   - [[https://www.youtube.com/watch?v=odkYXXYOxpo][Debugging basics by Nic Ferrier]]

   Edebug, instrumenting and stepping and breakpoints. Also
   macroexpand and how it helps with debugging.


*IDO Mode:*

    -  [[https://vimeo.com/1013263][What You Can Learn From ido.el]]


*Development Environment*

  - [[https://www.youtube.com/watch?v=-4O-ZYjQxks][Emacs Tutorial: Yasnippet]]
  - [[https://www.youtube.com/watch?v=FLpJR-0hL3I][Using Yasnippet in Emacs to write faster Scala code]]

  - [[https://www.youtube.com/watch?v=VnWVu8VVDbI][Installing Common Lisp, Emacs, Slime & Quicklisp]]

   This video will show you how to set up a decent common lisp
   development environment. This video is not going into great
   detail of how everything works just yet but will get you a working
    environment so you can start exploring the tools available to you.
  (It also shows how to setup Emacs on Windows)

  - [[https://www.youtube.com/watch?v=zobx3T7hGNA][Emacs - Magit Basics]]  (Git integration to Emacs)

  This Screencast shows basic features of the Magit like this git commands.

  - [[https://www.youtube.com/watch?v=5FQwQ0QWBTU][CppCon 2015: Atila Neves "Emacs as a C++ IDE"]]

  - [[https://www.youtube.com/watch?v=MBhJBMYfWUo][Searching the Web with engine-mode]]


*Org-mode*

  - [[https://www.youtube.com/watch?v=KdcXu_RdKI0][How I Use org-capture and Stuff]]
    Org-capture is a great way to take notes and plan in Emacs. Capture templates provide a flexible way to extend org-capture and personalize the way you record various bits of information.

*Non Categorized*

  - [[https://www.youtube.com/watch?v=QFClYrhV1z4][Emacs Lisp Development - John Wiegley - Emacs Conference 2013]]

  - [[https://www.youtube.com/watch?v=zzbEjmlIET0][Turtle Graphics with Emacs Lisp]]

  Ray Puzio shows us his implementation of turtle graphics in emacs
  and takes us under the shell to see how it works. Turtle graphics
  are a way of  drawing pictures in which one provides a series of
  directions such as "move forward" or "turn left" to steer the pen.
  (The name comes from the fact that the original implementation
  involved  a robotic turtle as an output device controlled by the
  computer.) In addition to providing a useful and entertaining
  program, this talk also discusses techniques of pbm graphics and
  the use of a buffer for drawing which are of general use when
  doing graphics in emacs.

  - [[https://www.youtube.com/watch?v=XjKtkEMUYGc][Writing A Spotify Client in 16 Minutes]]
   You can write a Spotify client in no time at all, using Emacs. With
    a bit of research and the marvellous Helm front end, it's actually
    surprisingly easy to assemble. (Much faster than editing a
    screencast about it!)

** Selected Codes

    * http://forge.scilab.org/index.php/p/scilab-emacs/source/tree/master/scilab.el

    * http://repo.or.cz/w/emacs.git/blob_plain/emacs-24:/lisp/progmodes/python.el

    * http://emacswiki.org/emacs/file-template.el

    * http://aperiodic.net/phil/configs/elisp/ledger.el

    * http://sachachua.com/notebook/emacs/small-functions.el

    * http://web.mit.edu/Emacs/source/emacs/lisp/emacs-lisp/easymenu.el

    * http://code.haskell.org/haskellmode-emacs/haskell-mode.el

    * http://pastebin.com/h2G9Ua5p

    * https://raw.githubusercontent.com/rejeep/f.el/master/f.el

    * https://github.com/dimitri/el-get

Large Collection of Codes to Emacs

    * http://www.damtp.cam.ac.uk/user/eglen/emacs/ell.html

