Resources.org
** Technical Notes

*Emacs architecture:*

    * [[https://www.gnu.org/software/emacs/emacs-paper.html][EMACS: The Extensible, Customizable Display Editor by Richard Stallman]]

*REPL - Erlang Emacs Extension: Distel*

    * [[http://www.erlang.org/euc/02/distel.ps][Distel: Distributed Emacs for Erlang]]
    * [[http://massemanet.github.io/distel/][Distel emacs - erlang IDE - Github Repository]]
    * [[ftp://publications.ai.mit.edu/ai-publications/pdf/AITR-1451.pdf][Emacs Lisp in Edwin Scheme  AI Memo No. TR-1451 - MIT by Mattew Birkholz]]

*Key Bindings and Emacs Terminology*

    * [[http://aliquote.org/memos/2014/08/04/a-modular-configuration-for-emacs][A modular configuration for Emacs / Ergoemacs]]
    * [[http://ergoemacs.org/emacs/modernization.html][Modernization of Emacs (Simple Changes Emacs Should Adopt)]]

*Emacs Bytecodes*

    - http://www.chemie.fu-berlin.de/chemnet/use/info/elisp/elisp_15.html
    - [[http://nullprogram.com/blog/2014/01/04/][Emacs Bytecodes internals]]

*Forth Compiler to Emacs Bytecodes*

    - https://github.com/larsbrinkhoff/lbForth/blob/master/targets/emacs/forth.el
    - https://github.com/larsbrinkhoff/lbForth/blob/master/targets/emacs/asm.fth

*IDEs*

    - [[http://www.slideshare.net/ldami/emacs-a-performant-ide-for-perl-1819917][Emacs, a performant IDE for Perl]]
    - [[http://www.slideshare.net/chaitanyagupta/slime-1180051?qid=e6edde21-ed4f-457c-99be-69c1562985bb&v=qf1&b=&from_search=31][An introduction to SLIME, the Superior Lisp Interaction Mode for  Emacs.]]

*Lisp*

  - [[http://www.slideshare.net/kyleburton/introduction-to-lisp?qid=a835a3eb-d34b-4b76-a421-877be2eceee0&v=qf1&b=&from_search=3][Introduction to Lisp. A survey of lisp's history, current incarnations and advanced features such ]]
  - [[http://www.slideshare.net/aniruddha.chakrabarti/lisp-53412403?qid=f965a29a-27cc-4ed7-a3ca-ddffc84eeba5&v=qf1&b=&from_search=5][High level overview of Lisp programming language]]
  - [[http://www.slideshare.net/fukamachi/redesigning-common-lisp?qid=f965a29a-27cc-4ed7-a3ca-ddffc84eeba5&v=qf1&b=&from_search=8][Redesigning Common Lisp]]
  - [[http://www.slideshare.net/vseloved/lisp-for-python-programmers?qid=a835a3eb-d34b-4b76-a421-877be2eceee0&v=qf1&b=&from_search=4][Lisp for Python Programmers]]
  - [[http://paulgraham.com/diff.html][What Made Lisp Different]] by Paul Graham
