Resources.html

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> Technical Notes</h3>
<div class="outline-text-3" id="text-1-13">
<p>
<b>Emacs architecture:</b>
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/emacs-paper.html">EMACS: The Extensible, Customizable Display Editor by Richard Stallman</a>
</li>
</ul>

<p>
<b>REPL - Erlang Emacs Extension: Distel</b>
</p>

<ul class="org-ul">
<li><a href="http://www.erlang.org/euc/02/distel.ps">Distel: Distributed Emacs for Erlang</a>
</li>
<li><a href="http://massemanet.github.io/distel/">Distel emacs - erlang IDE - Github Repository</a>
</li>
<li><a href="ftp://publications.ai.mit.edu/ai-publications/pdf/AITR-1451.pdf">Emacs Lisp in Edwin Scheme  AI Memo No. TR-1451 - MIT by Mattew Birkholz</a>
</li>
</ul>

<p>
<b>Key Bindings and Emacs Terminology</b>
</p>

<ul class="org-ul">
<li><a href="http://aliquote.org/memos/2014/08/04/a-modular-configuration-for-emacs">A modular configuration for Emacs / Ergoemacs</a>
</li>
<li><a href="http://ergoemacs.org/emacs/modernization.html">Modernization of Emacs (Simple Changes Emacs Should Adopt)</a>
</li>
</ul>

<p>
<b>Emacs Bytecodes</b>
</p>

<ul class="org-ul">
<li><a href="http://www.chemie.fu-berlin.de/chemnet/use/info/elisp/elisp_15.html">http://www.chemie.fu-berlin.de/chemnet/use/info/elisp/elisp_15.html</a>
</li>
<li><a href="http://nullprogram.com/blog/2014/01/04/">Emacs Bytecodes internals</a>
</li>
</ul>

<p>
<b>Forth Compiler to Emacs Bytecodes</b>
</p>

<ul class="org-ul">
<li><a href="https://github.com/larsbrinkhoff/lbForth/blob/master/targets/emacs/forth.el">https://github.com/larsbrinkhoff/lbForth/blob/master/targets/emacs/forth.el</a>
</li>
<li><a href="https://github.com/larsbrinkhoff/lbForth/blob/master/targets/emacs/asm.fth">https://github.com/larsbrinkhoff/lbForth/blob/master/targets/emacs/asm.fth</a>
</li>
</ul>

<p>
<b>IDEs</b>
</p>

<ul class="org-ul">
<li><a href="http://www.slideshare.net/ldami/emacs-a-performant-ide-for-perl-1819917">Emacs, a performant IDE for Perl</a>
</li>
<li><a href="http://www.slideshare.net/chaitanyagupta/slime-1180051?qid=e6edde21-ed4f-457c-99be-69c1562985bb&v=qf1&b=&from_search=31">An introduction to SLIME, the Superior Lisp Interaction Mode for  Emacs.</a>
</li>
</ul>

<p>
<b>Lisp</b>
</p>

<ul class="org-ul">
<li><a href="http://www.slideshare.net/kyleburton/introduction-to-lisp?qid=a835a3eb-d34b-4b76-a421-877be2eceee0&v=qf1&b=&from_search=3">Introduction to Lisp. A survey of lisp's history, current incarnations and advanced features such </a>
</li>
<li><a href="http://www.slideshare.net/aniruddha.chakrabarti/lisp-53412403?qid=f965a29a-27cc-4ed7-a3ca-ddffc84eeba5&v=qf1&b=&from_search=5">High level overview of Lisp programming language</a>
</li>
<li><a href="http://www.slideshare.net/fukamachi/redesigning-common-lisp?qid=f965a29a-27cc-4ed7-a3ca-ddffc84eeba5&v=qf1&b=&from_search=8">Redesigning Common Lisp</a>
</li>
<li><a href="http://www.slideshare.net/vseloved/lisp-for-python-programmers?qid=a835a3eb-d34b-4b76-a421-877be2eceee0&v=qf1&b=&from_search=4">Lisp for Python Programmers</a>
</li>
<li><a href="http://paulgraham.com/diff.html">What Made Lisp Different</a> by Paul Graham
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2016-09-29 qui 05:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
